Обучение/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Обучение/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Обучение/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.ХранилищеИзображений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеТовара</name>
    <type>
      <types>CatalogRef.ПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Обучение/src/Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокументаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Стр Из Объект.Товары Цикл
	
		Стр.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
	
	КонецЦикла;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Синий);
	
	ОтборВидНоменклатуры =  ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборВидНоменклатуры.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВидНоменклатуры");
	ОтборВидНоменклатуры.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборВидНоменклатуры.ПравоеЗначение = Перечисления.ВидыНоменклатуры.Материал;
	
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Использование = Истина;
	оформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("ТоварыНоменклатура");
	
	ВидыНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Товар);
	ВидыНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Материал);
	ВидыНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Продукция);
	
	Услуга = Перечисления.ВидыНоменклатуры.Услуга;
	
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) и не ЗначениеЗаполнено(Параметры.Основание)
	//	и Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	//	
	//	Объект.Склад = ХранилищеОбщихНастроек.Загрузить("ОсновнойСклад");		
	//
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай1(Команда)
	
	А = 1;
	
	Если Модифицированность или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("А", А);
	
		ПоказатьВопрос(Новый ОписаниеОповещения("СложныйСлучай1Завершение", ЭтотОбъект , ДополнительныеПараметры), "Предварительно документ необходимо сохранить. Сохранить документ?", РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	СложныйСлучай1Фрагмент(А);
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай1Завершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса =
		КодВозвратаДиалога.Да Тогда
		ДокументЗаписан = Записать();
	Иначе
		ДокументЗаписан = Ложь;
	КонецЕсли;	
	
	Если Не ДокументЗаписан Тогда
		Возврат;
	КонецЕсли;
	
	
	СложныйСлучай1Фрагмент(ДополнительныеПараметры.А);

КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай1Фрагмент(А)
	
	А = А+1;
	Сообщить("Программный код после условия");
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай2_Команда1(Команда)
	
	А = 1;
	ДополнительныеПараметры = Новый Структура("А", А);
	
	Оповещение = Новый ОписаниеОповещения("СложныйСлучай2_Команда1Продолжение", ЭтотОбъект , ДополнительныеПараметры);
	СохранитьДокументИВыполнитьКод(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай2_Команда1Продолжение(Результат, ДополнительныеПараметры) Экспорт

	А = ДополнительныеПараметры.А;
	А = А + 1;
	
	Сообщить("Программный код - команда 1");
	
КонецПроцедуры // СложныйСлучай2_Команда1Продолжение()

&НаКлиенте
Процедура СложныйСлучай2_Команда2(Команда)
	
	Оповещение = Новый ОписаниеОповещения("СложныйСлучай2_Команда2Продолжение", ЭтотОбъект);
	СохранитьДокументИВыполнитьКод(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай2_Команда2Продолжение(Результат, ДополнительныеПараметры) Экспорт

	Сообщить("Программный код - команда 2");
	
КонецПроцедуры // СложныйСлучай2_Команда2Продолжение()

&НаКлиенте
Процедура СохранитьДокументИВыполнитьКод(Оповещение)

	Если Модифицированность или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьДокументИВыполнитьКодЗавершение", ЭтотОбъект, Оповещение),
					   "Предварительно документ необходимо сохранить. Сохранить документ?",
					   РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументИВыполнитьКодЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да и Записать() Тогда
	
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры);	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ВидНоменклатуры = ПолучитьВидНоменклатурыНаСервере(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидНоменклатурыНаСервере(Номенклатура)

	Возврат Номенклатура.ВидНоменклатуры;	

КонецФункции // ПолучитьВидНоменклатурыНаСервере()

&НаКлиенте
Процедура Подбор(Команда)
	
	//Отбор = Новый Структура;
	//Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТовары Тогда
	//	Отбор.Вставить("ВидНоменклатуры",  ВидыНоменклатуры.ВыгрузитьЗначения());
	//	ИмяТабЧасти = "Товары";
	//Иначе
	//	Отбор.Вставить("ВидНоменклатуры", Услуга);
	//	ИмяТабЧасти = "Услуги";	
	//КонецЕсли;	
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	//ПараметрыФормы.Вставить("Отбор", Отбор);
	//
	//Форма = ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	//Форма.Автозаголовок = Ложь;
	//Форма.Заголовок = "Подбор номенклатуры ("+ИмяТабЧасти+")";
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораУправляемая", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТовары Тогда
			ТабЧасть= Объект.Товары;
		Иначе
			ТабЧасть = Объект.Услуги;		
		КонецЕсли;
		
		НовСтр = ТабЧасть.Добавить();
		НовСтр.Номенклатура = ВыбранноеЗначение;
		НовСтр.Количество = 1;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") и ВыбранноеЗначение.Свойство("Номенклатура") Тогда
		
		Если ВыбранноеЗначение.ВидНоменклатуры = Услуга Тогда
			ИмяТЧ = "Услуги";
		Иначе
			ИмяТЧ = "Товары";
		КонецЕсли;

		НовСтр = Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыбранноеЗначение);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы["Группа"+ИмяТЧ];
		Элементы[ИмяТЧ].ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры
